app/controllers/public/members_controller.rb

  def update
    @member = current_member
        if @member.update(member_params)
---
UPDATE "members" SET "address" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["address", "rrr"], ["updated_at", "2021-09-17 06:34:44.679667"], ["id", 8]]

  def withdrawal
    member = current_member
    #is_deletedカラムにフラグを立てる(default→false(有効状態)をtrue(無効状態)にする）
    member.update(is_deleted: true)
---
UPDATE "members" SET "is_deleted" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["is_deleted", 1], ["updated_at", "2021-09-17 05:32:43.518182"], ["id", 7]]